cf/Catalogs/ЗаданияНаРезервныеКопии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ЗаданияНаРезервныеКопии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПодкаталоги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьИсточник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьПриемник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрРасписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перемещать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сжимать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьФайлыСтарше</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/ЗаданияНаРезервныеКопии/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если Не ПометкаУдаления Тогда
	
		// Проверим чтобы пути существовал
		
		Каталог = Новый Файл(ПутьИсточник);
		Если Не Каталог.Существует() Тогда 
			Отказ = Истина; 
			МодульРезевногоКопирования.СообщитьОшибку("Не существует путь источник
															|" + ПутьИсточник, "ПутьИсточник", ЭтотОбъект); КонецЕсли;
		Каталог = Новый Файл(ПутьПриемник);
		Если Не Каталог.Существует() Тогда 
			Отказ = Истина; 
			МодульРезевногоКопирования.СообщитьОшибку("Не существует путь приемник
															|" + ПутьПриемник , "ПутьПриемник", ЭтотОбъект); КонецЕсли;
		Если Не Отказ И ПутьПриемник = ПутьИсточник Тогда
			Отказ = Истина; 
			МодульРезевногоКопирования.СообщитьОшибку("Путь источника не должен быть равен пути приемнику"); КонецЕсли;КонецЕсли;
	
	Если Не Отказ И Не ПустаяСтрока(Расписание) Тогда
		стрРасписание = Строка(ЗначениеИзСтрокиВнутр(Расписание)) КонецЕсли;
	
КонецПроцедуры
